# -*- coding: utf-8 -*-

from destinations import cities_code_to_name_dict
from pprint import pprint

cities = ['Париж', 'Берлин', 'Брюссель', 'Лейпциг', 'Барселона', 'Лиссабон', 'Порту', 'Стамбул', 'Лондон', 'Мадрид', 'Рим', 'Вена', 'Будапешт', 'Бухарест', 'Гамбург', 'Варшава', 'Мюнхен', 'Милан', 'Прага', 'София', 'Казань', 'Брюссель', 'Бирмингем', 'Тбилиси', 'Кёльн', 'Ереван', 'Одесса', 'Неаполь', 'Стокгольм', 'Турин', 'Марсель', 'Скопье', 'Амстердам', 'Лидс', 'Краков', 'Франкфурт', 'Севилья', 'Палермо', 'Сарагоса', 'Рига', 'Роттердам', 'Вроцлав', 'Хельсинки', 'Вильнюс', 'Генуя', 'Штутгарт', 'Глазго', 'Осло', 'Копенгаген', 'Дюссельдорф', 'Дортмунд', 'Эссен', 'Малага', 'Познань', 'Бремен', 'Лиссабон', 'Дублин', 'Дрезден', 'Лейпциг', 'Ганновер', 'Манчестер', 'Гётеборг', 'Ливерпуль', 'Лион', 'Гаага']

name_to_codes_dict = {v:k for k, v in cities_code_to_name_dict.items()}

city_codes = []
for city in cities:
	city_codes.append(name_to_codes_dict[city])

print(city_codes)
